Revit 2024 API
PanelSchedulePhaseLoadType Enumeration
 Declares the panel schedule type. The comments for each enum type show a simple example of how the layout would look when applied to a panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum PanelSchedulePhaseLoadType
Visual Basic
Public Enumeration PanelSchedulePhaseLoadType
Visual C++
public enum class PanelSchedulePhaseLoadType
Members
Member name | Description
NoLoadInformation |  No load information
LoadsByPhaseInSplitColumns |  | Ckt | A | B | C | Ckt | | 1 | 100 | 200 | x | x | x | x | 2
MirroredPhaseColumns |  | Ckt | A | B | C | A | B | C | Ckt | | 1 | 100 | x | x | 200 | x | x | 2
LoadsByPhaseInSharedColumns |  | Ckt | A | B | C | Ckt | | 1 | 100/200 | x | x | 2
LoadsByPhase |  | Ckt | A | B | C | Ckt | | 1 | 100 | x | x | | | | 200 | x | x | 2
TotalLoadOnlyPerCircuit |  | Ckt | Load | | 1 | 100 | | 2 | 200
SeperatePhaseLoadsPerCircuit |  | Ckt | A | B | C | | 1 | 100 | 0 | 0 | | 2 | 200 | 0 | 0
See Also
Autodesk.Revit.DB.Electrical Namespace